{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {
        "__ctx_group__": "mlu"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_conv0_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_conv0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-5", 
        "bottom_mlu_scale": "1.50738", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_conv_first": "True", 
        "mlu_stdt": "True",
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.01236"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ], 
        [
          1, 
          0, 
          0
        ], 
        [
          463, 
          0, 
          0
        ],
        [
         464,
         0,
         0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm0_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm0_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm0_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm0_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_batchnorm0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ], 
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          1
        ], 
        [
          6, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_relu0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_conv1_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_conv1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "0", 
        "bottom_mlu_scale": "1.93079", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.19696"
      }, 
      "inputs": [
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm1_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm1_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm1_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm1_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_batchnorm1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          1
        ], 
        [
          14, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_relu1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          15, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_conv2_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(40, 24, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_conv2_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "0", 
        "bottom_mlu_scale": "1.57395", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "40", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.3545"
      }, 
      "inputs": [
        [
          16, 
          0, 
          0
        ], 
        [
          17, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm2_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(40L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm2_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(40L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm2_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(40L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_batchnorm2_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(40L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_batchnorm2_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          1
        ], 
        [
          22, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_relu2_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "resnetv1d_pool0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "global_pool": "False", 
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [
        [
          24, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv0_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 40, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-1", 
        "bottom_mlu_scale": "1.48107", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.9194"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ], 
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm0_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm0_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm0_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm0_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          1
        ], 
        [
          31, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv1_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-2", 
        "bottom_mlu_scale": "1.58349", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.49853"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          34, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm1_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm1_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm1_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm1_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ], 
        [
          38, 
          0, 
          1
        ], 
        [
          39, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          40, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv2_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80, 32, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv2_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-2", 
        "bottom_mlu_scale": "1.57282", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.53127"
      }, 
      "inputs": [
        [
          41, 
          0, 
          0
        ], 
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm2_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm2_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm2_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm2_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm2_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          1
        ], 
        [
          47, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Pooling", 
      "name": "resnetv1d_down1_pool0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "count_include_pad": "False", 
        "global_pool": "False", 
        "kernel": "(1, 1)", 
        "pad": "(0, 0)", 
        "pool_type": "avg", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_down1_conv0_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80, 40, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_down1_conv0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-1", 
        "bottom_mlu_scale": "1.48107", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-7", 
        "weight_mlu_scale": "1.08663"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          50, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_down1_batchnorm0_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_down1_batchnorm0_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_down1_batchnorm0_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_down1_batchnorm0_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_down1_batchnorm0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ], 
        [
          54, 
          0, 
          1
        ], 
        [
          55, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "elemwise_add", 
      "name": "resnetv1d_layers1_bottleneckv1b0__plus0", 
      "attrs": {
        "__ctx_group__": "mlu"
      }, 
      "inputs": [
        [
          48, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu2_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv3_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8, 80, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv3_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-1", 
        "bottom_mlu_scale": "1.32503", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "8", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.20188"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm3_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm3_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm3_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm3_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(8L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm3_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          60, 
          0, 
          0
        ], 
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          1
        ], 
        [
          64, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu3_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv4_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 8, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv4_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-2", 
        "bottom_mlu_scale": "1.48686", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.14286"
      }, 
      "inputs": [
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm4_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm4_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm4_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm4_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm4_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ], 
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          1
        ], 
        [
          72, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu4_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          73, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv5_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80, 16, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv5_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-2", 
        "bottom_mlu_scale": "1.43424", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.05296"
      }, 
      "inputs": [
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm5_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm5_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm5_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm5_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm5_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ], 
        [
          78, 
          0, 
          0
        ], 
        [
          79, 
          0, 
          1
        ], 
        [
          80, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "elemwise_add", 
      "name": "resnetv1d_layers1_bottleneckv1b1__plus0", 
      "attrs": {
        "__ctx_group__": "mlu"
      }, 
      "inputs": [
        [
          81, 
          0, 
          0
        ], 
        [
          58, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu5_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv6_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 80, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv6_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-1", 
        "bottom_mlu_scale": "1.33148", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.18931"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm6_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm6_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm6_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm6_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm6_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          85, 
          0, 
          0
        ], 
        [
          86, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          1
        ], 
        [
          89, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu6_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          90, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv7_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24, 16, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv7_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-3", 
        "bottom_mlu_scale": "1.42185", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.44318"
      }, 
      "inputs": [
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm7_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm7_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm7_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm7_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm7_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          93, 
          0, 
          0
        ], 
        [
          94, 
          0, 
          0
        ], 
        [
          95, 
          0, 
          0
        ], 
        [
          96, 
          0, 
          1
        ], 
        [
          97, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu7_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          98, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_conv8_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80, 24, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers1_conv8_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-3", 
        "bottom_mlu_scale": "1.33947", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "80", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.44531"
      }, 
      "inputs": [
        [
          99, 
          0, 
          0
        ], 
        [
          100, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm8_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm8_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm8_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers1_batchnorm8_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(80L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers1_batchnorm8_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          101, 
          0, 
          0
        ], 
        [
          102, 
          0, 
          0
        ], 
        [
          103, 
          0, 
          0
        ], 
        [
          104, 
          0, 
          1
        ], 
        [
          105, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "elemwise_add", 
      "name": "resnetv1d_layers1_bottleneckv1b2__plus0", 
      "attrs": {
        "__ctx_group__": "mlu"
      }, 
      "inputs": [
        [
          106, 
          0, 
          0
        ], 
        [
          83, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers1_relu8_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          107, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_conv0_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 80, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers2_conv0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-1", 
        "bottom_mlu_scale": "1.27935", 
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-8", 
        "weight_mlu_scale": "1.18553"
      }, 
      "inputs": [
        [
          108, 
          0, 
          0
        ], 
        [
          109, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_batchnorm0_gamma", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_batchnorm0_beta", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_batchnorm0_running_mean", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_batchnorm0_running_var", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "resnetv1d_layers2_batchnorm0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "inputs": [
        [
          110, 
          0, 
          0
        ], 
        [
          111, 
          0, 
          0
        ], 
        [
          112, 
          0, 
          0
        ], 
        [
          113, 
          0, 
          1
        ], 
        [
          114, 
          0, 
          1
        ]
      ]
    }, 
    {
      "op": "Activation", 
      "name": "resnetv1d_layers2_relu0_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "act_type": "relu"
      }, 
      "inputs": [
        [
          115, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_conv1_weight", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(88, 32, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "resnetv1d_layers2_conv1_fwd", 
      "attrs": {
        "__ctx_group__": "mlu", 
        "bottom_mlu_position": "-2", 
        "bottom_mlu_scale": "1.2477", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "mlu_sparse": "True", 
        "no_bias": "True", 
        "num_filter": "88", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)", 
        "weight_mlu_dtype": "fix8", 
        "weight_mlu_position": "-9", 
        "weight_mlu_scale": "1.00343"
      }, 
      "inputs": [
        [
          116, 
          0, 
          0
        ], 
        [
          117, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "resnetv1d_layers2_batchnorm1_gamma", 
      "attrs": {
